Revit 2016 API
LoadCase.NatureId Property
 The nature of the load case.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2016
Syntax
C#
public ElementId NatureId { get; set; }
Visual Basic
Public Property NatureId As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ NatureId {
	ElementId^ get ();
	void set (ElementId^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was NULL
See Also
LoadCase Class
Autodesk.Revit.DB.Structure Namespace